admin/org_roam/20240904151910-mth3100assessment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-04 Wed 15:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MTH3100Assessment</title>
<meta name="author" content="Paul Hewson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">MTH3100Assessment</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb0c77ab">1. Assessment Rubric</a>
<ul>
<li><a href="#orgb5a3f90">1.1. Journal. 15% of total module mark.</a></li>
<li><a href="#org9942616">1.2. Employer’s Report. 10% of module mark.</a></li>
<li><a href="#orgf82cb5b">1.3. Technical Report. 60% of module mark.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
From <a href="https://ele.exeter.ac.uk/course/view.php?id=12595">MTH3100 Industrial Placement ELE</a> - Industrial Placement (MTH3100<sub>A23</sub><sub>12</sub><sub>202324</sub>) 
</p>

<div id="outline-container-orgb0c77ab" class="outline-2">
<h2 id="orgb0c77ab"><span class="section-number-2">1.</span> Assessment Rubric</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summative Assessment</th>
<th scope="col" class="org-right">Weight</th>
<th scope="col" class="org-right">Due date</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Journal</td>
<td class="org-right">15%</td>
<td class="org-right">13.9.2024</td>
</tr>

<tr>
<td class="org-left">Employer’s Report</td>
<td class="org-right">10%</td>
<td class="org-right">13.9.2024</td>
</tr>

<tr>
<td class="org-left">Technical Report</td>
<td class="org-right">60%</td>
<td class="org-right">13.9.2024</td>
</tr>

<tr>
<td class="org-left">Poster</td>
<td class="org-right">15%</td>
<td class="org-right">20.9.2024</td>
</tr>
</tbody>
</table>


<p>
MTH3100 was a new module in 2021/22. As module leader, I learned a lot about what works well and what does not. Early due dates do not work well. Student placements can run June–June, September–September, or even June–September. Accordingly, most assignments are due 13 September 2024. This gives you the maximum time to work on your submissions, and also allows some time for the Department to progress you to the next year by mid-October, which is required. This date allows for students to request extensions (up to two weeks) to the due date. The date for poster submission is 20 September 2024, and the poster session will be timetabled for the first half of October. Note: The ELE page will have links to recorded lectures on the following topics: how to do a presentation, how to make figures, how to write a report, how to format a report, how to cite references, etc. Live lectures are not possible since you will be on placements.
</p>

<p>
Make sure that you learn from the videos. The markers will know if, for example, you did not learn about typography.
</p>
</div>

<div id="outline-container-orgb5a3f90" class="outline-3">
<h3 id="orgb5a3f90"><span class="section-number-3">1.1.</span> Journal. 15% of total module mark.</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A journal reflects your thoughts as you progress through your placement. It should contain what is important to you. Typically, this includes reflection on problems, work issues, being treated well or unfairly, and how you plan to resolve issues. There is no limit on the number of words, but more words will not automatically earn higher marks. 2000-3000 words is
plenty. You may choose to submit scans of your handwritten journal, as it was originally written. Or you may choose to create a document. The marking criteria are flexible. Markers are looking for evidence that you kept a journal as your placement progressed, and that it was useful to you. The journal is not a log of number of hours worked each day, or just facts. It is not a summary of what happened. It is a record of your thoughts.
</p>

<p>
Hand in time and date for journal - ELE by 12.00 hours on Friday 13 September 2024
</p>
</div>
</div>

<div id="outline-container-org9942616" class="outline-3">
<h3 id="org9942616"><span class="section-number-3">1.2.</span> Employer’s Report. 10% of module mark.</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This is a form to be filled out by your employer about your placement. It is worth 10% of your module mark (0/10 if it is not submitted). However, note that submitting the form earns you 10/10. What your employer writes has no effect on your overall mark. It is available as a PDF and a Word document on the ELE page.
</p>

<p>
Hand in time and date for employer’s report– ELE by 12.00 hours on Friday 13 September 2024
</p>
</div>
</div>

<div id="outline-container-orgf82cb5b" class="outline-3">
<h3 id="orgf82cb5b"><span class="section-number-3">1.3.</span> Technical Report. 60% of module mark.</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This report should not exceed 4000 words of text. You are required to write a report describing a specific project(s) or substantial piece of work that you undertook during your work placement. The 4000 words does not include references, figures, captions, etc. The report should include some references, using the academic style of your choice. These could be technical references, or resources you used to handle issues in your placement (e.g., a book on how to deal with office politics, or an article about discrimination in the workplace). The report must include the following sections, with the following titles – so do not do something different! Subsections are OK. You may include a brief summary (not marked) of the report, and include news such as being offered a job at your placement.
</p>

<ol class="org-ol">
<li>Introduction (20 marks)
<ul class="org-ul">
<li>The overall aim of the placement, including a description of the company’s structure and operations and an explanation of how the placement opportunity and work undertaken develops and extends your particular interests, skills and supports your career intentions.</li>
<li>Specification of the particular task(s) you were charged with on the placement, including a clear description of a ‘problem(s)’ or challenge(s) you tackled.</li>
</ul></li>
<li><p>
Technical Challenges (30 marks)
</p>
<ul class="org-ul">
<li>A clear outline of the strategy you employed to address the problem or challenge revealing how you have applied problem-solving skills and knowledge from your discipline area (link to the specific technical contents from specific modules you would have taken including module code). These are technical challenges and you must show how you applied discipline knowledge and expertise to solve them.</li>
</ul>
<p>
• An evaluation of your strategy which should determine and reveal your effectiveness in resolving the problem or challenge and makes recommendations for future enhancements. You should critically assess the professional technical skills you gained/developed during your internship.
</p></li>
<li>Interpersonal skills and workplace challenges (30 marks)
<ul class="org-ul">
<li>This section will enable you to identify and reflect on interpersonal workplace challenges and particular events which you consider to be noteworthy whilst undertaking your placement. For example, a difficult boss, unrealistic expectations, co-workers plotting against you, sexism/racism/cultural challeges. • These are not technical problems, but rather “soft” challenges that arise from office/workplace interaction, conflict, work deadlines, etc.</li>
<li>The idea behind selecting and reflecting on these particular events is that you should be able to consider them in the light of the discipline-related and personal skills which you will have brought to the placement and also how they have helped develop these and new skills in the workplace setting. Your journal should help you to identify the critical incidents you want to write about.</li>
<li>Reflection should be a critical process and you should be able to articulate your thoughts, ideas and perspectives to convey the process of learning which occurred during the placement. Write about what you were thinking at the time.</li>
</ul></li>
<li>Presentation (20 Marks)
<ul class="org-ul">
<li>An appropriate professional presentation, layout, style, and readability – failure to keep within the maximum word count (4000 words will be penalised by 5 marks.</li>
<li>Make sure you pay attention to the typography and data graphics videos.</li>
</ul></li>
</ol>

<p>
Hand in time and date for technical report – ELE by 12.00 hours on Friday 13 September 2024
</p>

<p>
Poster. 15% of module mark.
</p>

<p>
The poster session will take place during the first half of October after your placements are
complete.
There is no template for the poster—it is up to you to choose everything about the poster.
The posters have been printed in past years at the A1 size, but since the aspect ratio for all A
paper sizes is the same, it really does not matter. You will upload a PDF of your poster to
ELE, and all the posters will be printed for you, and then hung for you on the day of the
poster session.
</p>

<p>
Poster marking. The poster session is designed for you explain to an interested person what
you did, where, why, how the placement was related to your degree. Your poster will be
printed and displayed for you. There is no required template for the poster. Be sure to have
your name printed prominently at the top of the poster, so the markers can find you.
Hand in time and date for poster – Student Services Office (E-BART) by 12:00 Friday 22
September 2023.
</p>

<p>
Markers will use the following score sheet to mark you:
</p>

<p>
Student:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Feedback</th>
<th scope="col" class="org-left">Mark</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Visual impact</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">/5</td>
</tr>

<tr>
<td class="org-left"><i>Professional look,</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>layout, visual aids etc.</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Content</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">/10</td>
</tr>

<tr>
<td class="org-left"><i>Contains all necessary</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>information. Well</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>organised. Clear and</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>legible. Easy to follow</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>for non-specialists</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Interview</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">/5</td>
</tr>

<tr>
<td class="org-left"><i>Knowledge of project and</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>work undertaken. Ability</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>to convey  your placement</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>experience to an audience</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Total</td>
<td class="org-left">/20</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paul Hewson</p>
<p class="date">Created: 2024-09-04 Wed 15:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
